stress.yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 250
      rampTo: 500
      name: "warming up"
    - duration: 60
      arrivalRate: 1000
      name: "max load"
scenarios:
  - flow:
    - get:
        url: "/rooms/{{$randomNumber(1,100000)}}"
    - post:
        url: "/rooms"